public/signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
            <soapenv:Header/>
            <soapenv:Body><RegisterInvoiceRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="https://efi.tax.gov.me/fs/schema" Id="Request" Version="1">

    <Header SendDateTime="2021-04-28T19:40:11+02:00" UUID="a0589f4d-b37e-49bf-806b-662db3a01bcc"/>

    <Invoice TypeOfInv="NONCASH" IsSimplifiedInv="false" IssueDateTime="2021-04-28T19:40:11+02:00" InvNum="ya260ri698/32/2021/wp886vu280" InvOrdNum="32" TCRCode="wp886vu280" IsIssuerInVAT="true" TotPriceWoVAT="155.00" TotVATAmt="100.00" TotPrice="255.00" OperatorCode="ia871me776" BusinUnitCode="ya260ri698" SoftCode="qk433mq872" IIC="c735594c0c20661c9c711043ecc385c7" IICSignature="897291dc84898bc475ccda4837c38644f18a286cc40236ce12ac7a0c6a4c1e935da9494eb668fe51d550348bea00f8d5648b31f2125b7375c64289707936ca0e13228d90435525ca95a2e51df695f37f721986b9660dd8140f133738aa3fb63e063f9f284de9b7fc160ca1250179b39471604358af4382540923fb8ed8603c89066983f5774ff90c7c16b3f4b1cf8df2bc0947160702ee5ba7541987943cd290a693a9fe9514c963ce6619f1ee7393cdef8e1c772789f91d090b3af0c461b7e7922fc1f3c96d96bfa338dd951e8270bbdc556bc50784e943a5c616e2c1f1a70f7e17b0fc4ec54dadb5c77875c039ae941bf25c20ee2956f2df358400dd40fa5a" IsReverseCharge="false">
        <PayMethods>
            <PayMethod Type="ADVANCE" Amt="255.00"/>
        </PayMethods>

        <Seller IDType="TIN" IDNum="02829258" Name="Crnagoraput"/>

        <Buyer IDType="TIN" IDNum="12345678" Name="Cvijeta"/>


        <Items>
                            <I N="voluptatum" C="0" U="kom" Q="1.00" UPB="155.00" UPA="0.00" R="55.00" RR="1" PB="0.00" VR="0.07" VA="100.00" PA="255.00"/>
                    </Items>

        <SameTaxes>
                                                                            <SameTax NumOfItems="1" PriceBefVAT="155.00" VATRate="7.00" VATAmt="100.00"/>
                                                                </SameTaxes>
    </Invoice>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
  <SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
    <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
  <Reference URI="#Request"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><DigestValue>KaKL3qRVj2dfbdUktQNQpcFIWgkdWQNiyv09dbChQ/M=</DigestValue></Reference></SignedInfo><SignatureValue>mN6YcKe1oLLJ/ja5FS68NkDYmK8m6Wl8c+mLs1WTbITq45dXLYMrwTqho3hY5wyzs6OVw68wzwMhb9BZEqsWAqAXAqzl3PHH1mUSn7vcm3/z6kcdmE2z7XRiDsy+PDmlJzUJN1sOMZ0ln8w2AyB+rdV3r5DLa8N6UvEnLfZceoN12Wz+BMkibEkcnrVFRuxdflUrEnMV0eGe13Odex5WvV1IHubi+s/ei3oVROgnHofSUjcxATxpFHKWzURoHn1inUNA2/QkSa2IMHqu7rfmInTNc7OLEC6WOMVoddU91NKNdSREtkeOEKK6PceS67o9iocCSHrl12SXkzC3aSHuOg==</SignatureValue>
<KeyInfo><X509Data><X509Certificate>MIIHHTCCBYWgAwIBAgIEXQMMRjANBgkqhkiG9w0BAQsFADA0MQswCQYDVQQGEwJt
ZTEQMA4GA1UEChMHUG9zdGFDRzETMBEGA1UEAxMKUG9zdGFDRyBDQTAeFw0yMTAx
MTIwNzEzMDVaFw0yNDAxMTIwNzQzMDVaMIGAMQswCQYDVQQGEwJNRTEUMBIGA1UE
CxMLUHJhdm5vIGxpY2UxMTAVBgNVBGETDlZBVE1FLTAyODI5MjU4MBgGA1UEChMR
UkVTVEFSVCBJVCBkLm8uby4xKDAMBgNVBAUTBTQyODY0MBgGA1UEAxMRUkVTVEFS
VCBJVCBkLm8uby4wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQC0u6vT
75aX4Etzpo/RU8afyOoWQUe+FmpL7sL/jpJFPMte6OMgbms3qqWRYsgR2oJ2YU9d
mHZV7Cy+EEbdfV73IkIStkJuLyHHT+kxkp+dXLcykEe23e7VLnkCPzJ2nU4HUs4G
S6fTth4Z36srmgcFfJz3LHy8ii80/753A5sEjKWDbjrnvyTYr1v3i4WjGS61tqcW
LFdst9K7y5PiGB3KZeGkG0qg7iYLHTmo27ekVyNjAlgFiR/xNURM+hOJCH0DTHS5
SJ5VvdQ3PMczL74VEXKye6MgDtMeBH9UEZPOFsaOaqT4dfq+FL/Kd65a+qDFAez0
eZGcyPoWqa7rC8VRAgMBAAGjggNoMIIDZDAOBgNVHQ8BAf8EBAMCBsAwRQYDVR0g
BD4wPDA6BgwrBgEEAYKfAQEGAQQwKjAoBggrBgEFBQcCARYcaHR0cDovL3d3dy5w
b3N0YWNnLWNhLm1lL2NwczCBsgYIKwYBBQUHAQMEgaUwgaIwCAYGBACORgEBMIGA
BgYEAI5GAQUwdjA5FjNodHRwczovL3d3dy5wb3N0YWNnLWNhLm1lL2Nwcy9wb3N0
YWNnLWNhX3Bkc19lbi5wZGYTAmVuMDkWM2h0dHBzOi8vd3d3LnBvc3RhY2ctY2Eu
bWUvY3BzL3Bvc3RhY2ctY2FfcGRzX3NyLnBkZhMCc3IwEwYGBACORgEGMAkGBwQA
jkYBBgIwTgYIKwYBBQUHAQEEQjBAMD4GCCsGAQUFBzAChjJodHRwOi8vd3d3LnBv
c3RhY2ctY2EubWUvY2VyL1Bvc3RhQ0ctQ0FfY2FjZXJ0LmNlcjCBgAYDVR0SBHkw
d6R1MHMxCzAJBgNVBAYTAk1FMTYwNAYDVQQKEy1QT1NUQSBDUk5FIEdPUkUgQUtD
SU9OQVJTS08gRFJVU1RWTyBQT0RHT1JJQ0ExFzAVBgNVBGETDlZBVE1FLTAyODY3
OTQwMRMwEQYDVQQDEwpQb3N0YUNHIENBMIIBQQYDVR0fBIIBODCCATQwTKBKoEik
RjBEMQswCQYDVQQGEwJtZTEQMA4GA1UEChMHUG9zdGFDRzETMBEGA1UEAxMKUG9z
dGFDRyBDQTEOMAwGA1UEAxMFQ1JMNDUwgeOggeCggd2GW2xkYXA6Ly9sZGFwLnBv
c3RhY2ctY2EubWUvY249UG9zdGFDRyUyMENBLG89UG9zdGFDRyxjPW1lP2NlcnRp
ZmljYXRlUmV2b2NhdGlvbkxpc3QlM0JiaW5hcnmGPmh0dHA6Ly9laWQucG9zdGFj
Zy1jYS5tZS9jcmwvcG9zdGFjZ19jYV9wb3N0YWNnX21lX2NybGZpbGUuY3Jshj5o
dHRwOi8vd3d3LnBvc3RhY2ctY2EubWUvY3JsL3Bvc3RhY2dfY2FfcG9zdGFjZ19t
ZV9jcmxmaWxlLmNybDAfBgNVHSMEGDAWgBR3Y0xYMrlU0RoJ93Quq6uNPKoq8TAd
BgNVHQ4EFgQUV5q+2TeanEdIUlZlVxS81r6WkOwwDQYJKoZIhvcNAQELBQADggGB
AOBXnwm3bozLpkES2WypmCFHkFrNBmz9nm6XoLBsGx7uRcqRGsquQLVlAB/IRa+b
N14vQ6Vulcw9zv7kqDZFhi1txuWpvuxSZpx621EgZtIVDMUITmU8q9ezqNor7UgS
DhhfvIF6ZTkPM1UmBZpPMyLUtcxgZ1l3guZwu00ClcUQpb3S4710aM8CoFBGKHE9
65GXhSlriw0MUX0cgVANqV0FyKyuIOes2Lc7N0dHGKwKU8XbSziUaf+59Unigm5C
HxcT3ZvvMxl/+M65Whw4dkkajoeobpCm3YKuUb26/evjuH7EWki9dgKLQ1qSoDmQ
dDxIaNqK9c0hfbislxx3hrQcqQ9K/34Jr3sdS4Tq8142GRYoclKGebU62ds51a43
YfXo308Nx2mDsu6gd6yZvLP7JWBNB2Dvtc7bJHtciEOUtr5UN+AANgKG69JRRK4e
W4lhSwPSMKscth2PsAw0+hfi1i3aSThj6tTVrZLsnliMtrANXRJLETV9cbx7Ohzb
Sw==
</X509Certificate></X509Data></KeyInfo></Signature></RegisterInvoiceRequest>
</soapenv:Body>
            </soapenv:Envelope>